app/controllers/api/v1/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
    def index
        @quotes = Quote.all

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @quote = Quote.find(params[:id])

INSERT INTO "quotes" ("content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "don't try to build a wall, lay one brick at a time everyday. "], ["author", ""], ["created_at", "2020-07-09 15:12:19.024671"], ["updated_at", "2020-07-09 15:12:19.024671"]]
---
    def create
        @quote = Quote.create(check_params)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "quotes" SET "likes" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["likes", 1], ["updated_at", "2020-07-10 14:48:38.995288"], ["id", 25]]
---
    def update
        @quote = Quote.find(params[:id])
        @quote.update(check_params)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 20]]
---
    def destroy
        quote = Quote.find(params[:id])
        quote.destroy